print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

q = input('покрытая- q: ')

a = input('Кожиц..й a: ')

w = input('на- w: ')

s = input('ножк.. s: ')

e = input('затянута- e: ')

r = input('нижняя- r: ')

d = input('шляпк.. d: ')

print('Шляпка гриба, покрытая' + q + 'кожиц' + a + 'й, держится на ' + w +  'ножк '+ s + 'Снизу шляпка затянута ' + e + 'плёнкой. Когда её уберёшь, откроется нижняя ' + r + 'сторона шляпк ' )